<?php
// $Id$
// _LANGCODE: fa
// _CHARSET : UTF-8
// Translator: XOOPS Translation Team

$content .=
"<h3>سایت شما</h3>
<p>شما می‌توانید از این قسمت به <a href='../index.php'> صفحه اول سایت خود </a> بروید.</p>
<h3>پشتیبانی</h3>

";

$content .=
"<h3>تنظیمات امنیتی</h3>
<p>سیستم نصب تلاش میکند سایت شما را برای ملاحظات امنیتی پیکربندی کند. لطفا با دقت برسی کنید تا اطمینان حاصل کنید:
<div class='confirmMsg'>
فایل <em>mainfile.php</em> قابل نوشتن است.<br />
لطفا شاخه <em>{$installer_modified}</em> (یا شاخه <em>install</em> را اگر به طور خودکار نام آن در سرور شما عوض نشده بود.)  از روی سرور خود حذف کنید.
</div>
</p>
<p><strong>توجه :</strong> وب سایت شما هم اکنون با کمترین قابلیت مشغول کار است, اگر شما میخواهید محتوایی مثل: صفحات استاتیک, گالری تصاویر, انجمن, اخبار , مدیریت لینک ها , مقالات , ... در سایت خود وارد کنید ابتدا باید <a href='http://www.xoops.org/modules/repository' rel='external' title='انتخاب و دریافت ماژول ها'>ماژول های مورد نظر خود را از بخش ماژول های سایت محتوا دانلود</a> و نصب نمایید, همچنین قالب های محتوا را  <a href='http://www.xoops.org/modules/extgallery' rel='external' title='انتخاب و نصب قالب جدید'>از گالری قالب های محتوا دریافت کنید</a>.</p>
";

?>