<?php
// $Id: modinfo.php,v 1.8 2004/12/26 19:11:54 onokazu Exp $
// Module Info

// The name of this module
define("_MI_CONTACT_NAME","تماس");
پەیوەندی 
// A brief description of this module
define("_MI_CONTACT_DESC","ایمیل تماس با صفحه");
ئیمێڵی پەیوەندی لەگەڵ لاپەڕه

define('_MI_CONTACT_SETTINGS', 'تنظیمات');
ڕێکخستن
define('_MI_CONTACT_SETTINGS_DSC', 'تنظیمات کلی تماس با ما');
ڕێکخستنی گشتی پەیوەندی لەگەڵ ئێمە
define('_MI_CONTACT_GEN', 'کلی' );
گشتی
define('_MI_CONTACT_GEN_DSC', 'تنظیمات عمومی برای شروع و موضوع / تعاریف ایمیل' );
ڕێکخستنی هەمەلایەنه بۆ دەسپێک و سەر دێڕ/ناساندنەکانی ئیمێڵ 

// Config stuff
define("_MI_CONTACT_GETICQ", "جمع آوری ICQ" );
کۆ کردنەوه
define("_MI_CONTACT_GETICQDSC", "بله - پرسیدن ICQ" );
بەڵێ-پرسین

define("_MI_CONTACT_ALLOWSENDCONFIRM", "اجازه تکرار پیام" );
ئیزن بۆ دووبارەکردنەوەی پەیام
define("_MI_CONTACT_ALLOWSENDCONFIRMDSC", "بله - چک باکس را برای فرستنده نشان بده"
."" );
بەڵێ-چێک باکس بۆ بنێر نمایش بده

define("_MI_CONTACT_GETURL", "جمع آوری آدرس کاربر" );
کۆ کردنەوەی ناو نیشانی کاربەر
define("_MI_CONTACT_GETURLDSC", "بله - آدرس وب کاربر را بپرس" );
بەڵێ ناو نیشانی وێبی کاربەر بپرسه

define("_MI_CONTACT_GETCOMPANY", "جمع آوری اسم شرکت کاربر" );
کۆ کردنەوەی ناوی کۆمپانیای کاربەر
define("_MI_CONTACT_GETCOMPANYDSC", "بله - اسم شرکت کاربر را بپرس" );
بەڵێ-ناوی کۆمپانیای کاربەر بپرسه

define("_MI_CONTACT_GETLOC", "جمع آوری موقعیت کاربر" );
کۆ کردنەوەی بارو دۆخی کاربەر
define("_MI_CONTACT_GETLOCDSC", "بله - موقعیت کاربر را بپرس (آدرس کامل لازم نیست)‏" );
بەڵێ-بارودۆخی کاربەر بپرسه(ناو نیشانی تەواو پێویست نیه)

define("_MI_CONTACT_ADDRESS", "جمع اوری آدرس کاربر" );
کۆ کردنەوەی ناونیشانی  کاربەر
define("_MI_CONTACT_ADDRESSDSC", "بله - آدرس کاربر را بپرس" );
بەڵێ-ناو نیشانی کاربەر بپرسه

define("_MI_CONTACT_INTROHEAD", "مقدمه صفحه" );
پێشەکی لاپەڕه
define("_MI_CONTACT_INTROHEAD_DESC", "این متن  یک نمونه است برای <b>متن مقدمه</b>");
define("_MI_CONTACT_INTROHEAD_DESC", " ئەم دەقه نموونەیەکە بۆ <b>دەقی پێشەکی</b>");
define("_MI_CONTACT_INTRO_DEFAULT","لطفا فرم زیر را پر کنید و برای ما بفرستید ؛ <br />در اسرع وقت به شما پاسخ میدهیم!‏");
define("_MI_CONTACT_INTRO_DEFAULT","تکایه بەرژەنامەی ژێرو پڕ کەوه و بۆ ئێمەی بنێرە ؛ <br />ده زووترین کات دا وڵامی ئێوه دەدەینەوه!‏");

define("_MI_CONTACT_INTRO", "متن مقدمه" );
دەقی پێشەکی
define("_MI_CONTACT_INTRO_DESC", "متن میتواند استفاده شود برای مقدمه <b>تماس با ما</b><br />"."مثل : گفت و گو ؛ متن خوش آمد ؛ شماره تلفن ؛ ایمیل" );
define("_MI_CONTACT_INTRO_DESC", " دەق دەتوانرێ بەکار ببردرێ بۆ پێشەکی <b> پێوەندی لەگەڵ </b><br />"." وەکوو:وتو وێژ؛دەقی بەخێرهێنان؛ژمارەتەلەفۆن؛ئیمێڵ " );    
define("_MI_CONTACT_SECURITY", "بررسی امنیتی" );
لێکۆ ڵینەوەی ئەمنی
define("_MI_CONTACT_SECURITYDSC", "بله - فعال <b>؛</b> برای تایید اعتبار کاربران ایمیل تماس بفرست.<br />"."این ممکن است کمک کند به از بین بردن اسپم در <b>تماس با ما</b>!‏" );
define("_MI_CONTACT_SECURITYDSC", " بەڵێ- بەکار <b>؛</b> بۆ پەسندی هورمی کاربەران ئیمێڵی پێوەندی بنێره.<br />"." ئەمە شایەد یارمەتی بێ بۆ لەناو بردنی ئێسپێم دە<b> پێوەندی لەگەڵ ئێمەدا  </b>!‏" );	
define("_MI_CONTACT_SITEKEY", "کلید تصادفی" );
کلیلی بەختەکی

define("_MI_CONTACT_SITEKEYDSC", "ساخت هر نوع کاراکتر تصادفی مخلوط یااعداد برای <b>بررسی امنیتی</b><br />"."موردهای تصادفی بیشتر!" );
define("_MI_CONTACT_SITEKEYDSC", "درووست کردنی هەموو جۆر کاراکتەرێکی بەختەکی تێکەڵ یا ژماره بۆ <b> لێکۆڵینەوەی ئەمنی </b><br />"." بابەتەکانی  بەخته کی زیاتر!" );
define("_MI_CONTACT_HEAD", "عنوان تماس" );
سەردێڕی پێوەندی
define("_MI_CONTACT_HEADDSC", "سرنویس برای فرم تماس با ما");
سەرنووس بۆ بەرژەنامەی پێوەندی لەگەڵ ئێمه
define("_MI_CONTACT_HEADDEFAULT","فرم تماس");
بەرژەنامەی پێوەندی

define("_MI_CONTACT_THANKYOU", "بابت پیام متشکریم");
سپاست دەکەین بۆ پەیامەکەت
define("_MI_CONTACT_THANKYOUDSC", "پیام تشکر برای فرستنده");
ناردنی پەیامی پێزانین بۆ بنێر
define("_MI_CONTACT_THANKYOUDEFAULT", "با تشکر از شما برای تماس با من ؛ من به زودی به شما پاسخ خواهم داد");
سپاسی ئێوەی بەڕێز بۆ پێوەندی لەگەڵ من.ده زووترین کات دا وڵامت دەدەمەوه

define("_MI_CONTACT_TIMEOUT", "اتمام وقت ریدایرکت صفحه");
تەواو بونی کاتی رێدایرێکتی لاپەڕه
define("_MI_CONTACT_TIMEOUTDSC", "مقدار ثانیه ای که بعد از فرستادن پیام صفحه ریدایرکت ظاهر میشود");
ژمارەی ئەم چرکانەی که دوای ناردنی هەواڵی لاپەڕەی ریدایرێکت وەدی دێن

define("_MI_CONTACT_SHOWDEPT", "نمایش \"گروه/موضوع\" بخش");
نمایش\"گرووپ/بابەت\بەش"
define("_MI_CONTACT_SHOWDEPTDSC", "بله - نمایش منوی کشویی با تعریف واحد / نفر<br />"."اگر هیچ گروهی نشان داده نشد ؛ تمام ایمیل های تماس با ما به ایمیل سایت فرستاده شود" );
define("_MI_CONTACT_SHOWDEPTDSC", "بەڵێ-نمایشی پێڕستی کەشەوی به پێناسەی یەکەی نەفەر<br />"." ئەگەر هیچ گروپێک نمایش نەکرا؛هەمو ئیمێڵەکانی پێوەندی لەگەڵ ئێمە بنێردرێ بۆ ئیمێڵی ماڵپەڕ " ); 
define("_MI_CONTACT_DEPTTITLE", "\"گروه/موضوع\" تیتر");
"\گرووپ/بابەت\سەردێڕ"
define("_MI_CONTACT_DEPTTITLEDSC", "تیتر نشان داده شود در \"گروه/عنوان\" بخشی از فرم تماس با ما");
سەردێڕ نماتش بدرێ ده\گرووپ/سەرناو\"بەشێک لە بەرژەنامه
define("_MI_CONTACT_DEPTTITLEDEFAULT", "بخش");
بەشی

define("_MI_CONTACT_DEPT", "بخشها" );
بەشەکانی
define("_MI_CONTACT_DEPTDSC", "بخشها به شما توانایی تعریف بخش/ایمیل ترکیبی را میدهد . انتخاب اعضا<br />"
."از بخش تعریف اطلاعات تماس به مکاتبه کننده فرستاده میشود<br />"
."آدرس ایمیل تعریف کنید<br /><br />"
."هر یک از بخش/ایمیل را به صورت زیر تعریف کنید :‏<br /><br />"
."بخش1,ایمیل1 | بخش دو,ایمیل2 <br />"
." هر بخش و ایمیل باید بوسیله کاما ',' از هم جدا شود و همچنین هر قسمت شامل بخش و ایمیل بوسیله ' | ' از هم جدا شوند" );
define("_MI_CONTACT_DEPTDSC", "بەشەکان توانایی پێناسەی بەش/ئیمێڵی داڕشته به ئێوه دەدەن.هەڵبژارتنی ئەندام<br />"
." له بەشی پێناسەی زانیارێکان بۆ بنێری نامه دەنێر درێ <br />"
." ناو نیشانی ئیمێڵ بناسێنە<br /><br />"
." هەر یەک لە بەش/ئیمێڵ بەم جۆره بناسێنه:‏<br /><br />"
." بەشی١ئیمێڵی١|بەشی٢ ئیمێڵی ٢<br />"
." هەر بەش و ئیمێڵ دەبی به کاما',' لێک بکرێنەوه و هەر وەها هەربە شێک و ئیمێڵ دەبێ بە' | ' لێک بکرێنەوه" );




define("_MI_CONTACT_VALIDATEDOMAIN", "تشخیص اعتبار دامین ایمیل");
ڤەناسینی هورمی دامێینی ئیمێڵ
define("_MI_CONTACT_VALIDATEDOMAINDSC", "بله - فعال \"بررسی عمیق\"<br />"."نه - بررسی ساده ایمیل وارد شده");
define("_MI_CONTACT_VALIDATEDOMAINDSC", " بەڵێ-بەکارە\لێکۆ ڵینەوەی قووڵ\<br />"." نەخێر-لێکۆ ڵینەوەی ساکار ئیمێڵی نووسراو ");


define("_MI_CONTACT_SHOWMOREINFO", "نمایش \"اطلاعات بیشتر\" بخش" 
نمایش\زانیاری زیاتر/بەش
define("_MI_CONTACT_SHOWMOREINFODSC", "بله - نمایش بخش با امکان انتخاب چند گزینه ای توسط کاربر \"اطلاعات بیشتر\"");
بەڵێ-نمایشی ئەم بەشە به توانایی هەڵبژارتنی چەند تڵی به دەستی کاربەر\زانیاری زیاتر
define("_MI_CONTACT_SHOWMOREINFODSC", " ", "بله - نمایش بخش با امکان انتخاب چند
گزینه ای توسط کاربر \"اطلاعات بیشتر\"");
بەڵێ-نمایشی ئەم بەشه به توانایی هەڵبژارتنی چەند تڵی بەدەستی کاربەر\زانیاری زیاتر
define("_MI_CONTACT_MOREINFOTITLE", "\"اطلاعات بیشتر\" عنوان" );
نمایش\زانیاری زیاتر/بەش
define("_MI_CONTACT_MOREINFOTITLEDSC", "عنوان نشان داده شود در \"اطلاعات بیشتر\" بخشی از فرم تماس" );
سەر ناو نمایش بدرێ ده\"زانیاری زیاتر\"بەشێک له بەرژەنامەی پەیوەندی"):
define("_MI_CONTACT_MOREINFOTITLEDEFAULT","درخواست اطلاعات بیشتر");
داخوازی زانیاری زیاتر

define("_MI_CONTACT_MOREINFO", "\"اطلاعات بیشتر\" آیتمها");
زانیاری زیاتر\"ئایتمەکان
define("_MI_CONTACT_MOREINFODSC", "\"اطلاعات بیشتر\" آیتمها به شما امکان تعیین آیتمهایی که کاربر میتواند غیر فعال کند را میدهد<br />"
."برای مصلحت و یا نیاز به اطلاعات بیشتر ؛ این راهیست برای هدایت مشتریان<br />"
.""
.""
.""
."هر آیتم را به صورت زیر تعیین کنید:<br /><br />"
."آیتم1|آیتم2|آیتم3 - هر آیتم را بوسیله ' | ' از هم جدا کنید");
define("_MI_CONTACT_MOREINFODSC", "\"زانیاری زیاتر\"ئایتمەکان توانایی دەرخستنی ئەم ئایتمانه دەدەن که کاربەر دەتوانێ له کاریان بخات<br />"
." بۆ بەرژەوەندی یا نیاز به زانیاری زیاتر؛ئەم رێیه بۆ ڕینمونی کردنی مووشتەرێکان دانراوه<<br />"
.""
.""
.""
." هەر ئایتێم بەم جۆ رەدەرخه::<br /><br />"
." ئایتمی١|ئایتمی٢|ئایتمی٣-هەر ئایتم بە' | ' لێک جیا کەوه" ");
//1.71
// index.php
//define("_MI_CONTACT_ADMIN_INDEX",                  "Home");

define('_MI_CONTACT_MENU_00',"Home"); 
define("_MI_CONTACT_ADMIN_HOME_DESC","Go back to Home");

define("_MI_CONTACT_ADMIN_ABOUT",                  "About");
define("_MI_CONTACT_ADMIN_ABOUT_DESC" , "About this module");

define("_MI_CONTACT_ADMIN_HELP",                 "Help");
define("_MI_CONTACT_ADMIN_HELP_DESC" , "Module help");
?>