<?php

if( defined( 'FOR_XOOPS_LANG_CHECKER' ) ) $mydirname = 'protector' ;
$constpref = '_MI_' . strtoupper( $mydirname ) ;

if( defined( 'FOR_XOOPS_LANG_CHECKER' ) || ! defined( $constpref.'_LOADED' ) ) {



// Appended by Xoops Language Checker -GIJOE- in 2009-07-06 05:46:52
define($constpref.'_DBTRAPWOSRV','هیچ وقت _SERVER برای anti-SQL-Injection برسی نکن');
// Appended by Xoops Language Checker -GIJOE- in 2009-07-06 05:46:52
define($constpref.'_DBTRAPWOSRV','هیچکات _SERVER بۆ anti-SQL-Injection لێکۆڵینەوەی لەسەر مەکە');
define($constpref.'_DBTRAPWOSRVDSC','بعضی از کارگذار ‌ها اجازه میدهند سیستم تله گذاری پایگاه داده ‌ها فعال باشد. این باعث اشتباه در تشخیص حمله تزریق به SQL میشود. اگر شما خطا‌های دریافت کردید, این گزینه را روشن کنید. باید توجه داشته باشید که این گزینه باعث تضعیف سیستم تله گذاری لایه ‌های پایگاه داده ‌ها در برابر تزریق به sql میشود.');
define($constpref.'_DBTRAPWOSRVDSC','هێندێک لە کارگێڕەکان ئیزن دەدەن کە سیستەمی داو دانانەوەی بنکەی دێیتا بەکار بێت. ئەمە دەبێتە هۆی هێرش لە جۆری تەزریق(وەشاندن) SQL. ئەگەر ئێوە هەڵە هایەکتان وەرگرت, ئەم تڵە ڕۆشن کە. ئەبێ سرنج بدەی کە ئەم تڵە سیستەمی داو نانەوەی توێیەکانی بنکەی دێیتا لە بەرامبەر تەزریق(وەشاندن) sql لاواز دەکات');

// Appended by Xoops Language Checker -GIJOE- in 2009-01-14 11:10:53
define($constpref.'_DBLAYERTRAP','فعال سازی سیستم تله گذاری لایه ‌های پایگاه داده ‌ها در برابر تزریق به sql یا ( DB Layer trapping anti-SQL-Injection ) ');
// Appended by Xoops Language Checker -GIJOE- in 2009-01-14 11:10:53
define($constpref.'_DBLAYERTRAP','بە کار کردنی سیستەمی داو نانەوەی توێیەکانی بنکەی دییتا لە بەرامبەر تەزریق(وەشاندن) sql یا ( DB Layer trapping anti-SQL-Injection ) ');
define($constpref.'_DBLAYERTRAPDSC','همچنین حملات تزریق به SQL توسط این گزینه دفع میشوند. این ویژگی لازم دارد که توسط databasefactory پشتیبانی شود. شما میتوانید این گزینه را در صفحه مشاوره امنیتی برسی کنید.');
define($constpref.'_DBLAYERTRAPDSC','هەر وەها هێرشەکانی تەزریق(وەشاندن)بۆ SQL بە هۆی ئەم تڵە بەرگری دەکرێت. ئەم تایبەتمەندییە پێویستیتی بە databasefactory پشتیوانی بکرێت. ئێوە دەتوانن لێکۆلینەوەی ئەم تڵە دە لاپەڕەی ڕاوێژی ئەمنییەتی دا بکەن.');

define( $constpref.'_LOADED' , 1 ) ;

// The name of this module
define($constpref."_NAME","ماژۆڵی ئەمنییەتی پڕۆتێکتۆر");

// A brief description of this module
define($constpref."_DESC","ائەم ماژۆڵە ئاگاداری سایتی ناوەرۆکی ئێوە لە بەرامبەر هێرشەکانی ڤایروسی و لینکەکانی داسی ڕەخنە بە بنکەی دێیتا و...دەکا.");

// Menu
define($constpref."_ADMININDEX","ناوەندی پاراستن");
define($constpref."_ADVISORY","ڕاوێژی ئەمنییەتی");
define($constpref."_PREFIXMANAGER","بەڕێوبەری پێشگرەی ناوی خشتەکان دە بنکەی دێیتا دا");
define($constpref.'_ADMENU_MYBLOCKSADMIN','ڕادەستەکان');

// Configs
define($constpref.'_GLOBAL_DISBL','لەکار کردنی کاتی پاراستن');
define($constpref.'_GLOBAL_DISBLDSC','تمام حفاظت ‌ها به طور موقت غیر فعال میشود.<br />فراموش نکنید بعد از رفع نقص دوباره این گزینه را فعال کنید');
define($constpref.'_GLOBAL_DISBLDSC',' تەواوی پاراستنەکان بە شێوەی کاتی لە کار دەخسترێن.<br />لە بیر مەکە کە دوی لابردنی گرفتەکان ئەم تڵە دووبارە بەکار بکەییەوە');
define($constpref.'_DEFAULT_LANG','زمانی پێشگر');
define($constpref.'_DEFAULT_LANGDSC','ئەم زمانەی گەرەگتە بۆ نمایشی پەیامەکانی دوایی، لە کارکردی فایلی common.phpدابیین بکە.');
define($constpref.'_RELIABLE_IPS','IPییەکانی جێ متمانە');
define($constpref.'_RELIABLE_IPSDSC','IPییەکان بە|لە یەکتر جیا بکەوە.سەرەتای ڕیز بە^دابیین بکە و ئانتەکانی ڕیز بە$.');
define($constpref.'_LOG_LEVEL','پلەی سەقامگیر کردنی ڕووداوەکان');
define($constpref.'_LOG_LEVELDSC','');
define($constpref.'_BANIP_TIME0','کاتی هەڵپەساردنی IPییە ئیزن پێنەدراوەکان');
define($constpref.'_LOGLEVEL0','هیچ');
define($constpref.'_LOGLEVEL15','هێدی');
define($constpref.'_LOGLEVEL63','بێدەنگ');
define($constpref.'_LOGLEVEL255','تەواو');
define($constpref.'_HIJACK_TOPBIT','ئەژژماری بەیتەکانی IPلە هەر دانیشتن دا دە پارێزرێ');
define($constpref.'_HIJACK_TOPBITDSC','مقابله با دزدی جلسه (Anti Session Hi-Jacking):<br />به طور پیش فرض 32(bit). (تمام بیت ‌ها حفاظت شده است)<br />وقتی IP شما پایدار نیست, محدوده ی IP خود را باعددی مشخص از بیت ‌ها تنظیم کنید.<br /> اگر IP شما در محدوده ای بین 192.168.0.0 تا 192.168.0.255 میتواند تغییر کنید عدد 24 ( بیت) را انتخاب کنید <br /><br />Session Hi-Jacking(دزدی جلسه): در اصل ترکیب ماهرانه ای است از دو نوع حمله ی دزدین IP و استراق سمع با این روش حمله یک م‌هاجم خودش را به جای شما جا زده و اقدام به ادامه دادن کار ‌ها و فعالیت ‌های شما در سایت مطابق خواسته ی خود میکند البته در حدی که شما دسترسی دارید');
define($constpref.'_HIJACK_TOPBITDSC','بەر هەڵستی دزی دانیشتن (Anti Session Hi-Jacking):<br />بە شێوەی پێشگر 32(bit). (تەواوی بەیتەکان پارێزراون)<br />کاتێک IP ی ئێوە ڕاسا نییە, زێوارەی IP ی خۆت بە ژمارەیەک لە بەیتەکان دابیین بکە.<br /> ئەگەر IP ی ئێوە دە زێوارەیەک بەینی 192.168.0.0 تا192.168.0.255 دایە دەتوانێ بگۆڕدرێت ژمارەی 24 ( بیت) هەڵبژێرە <br /><br />Session Hi-Jacking(دزی دانیشتن): دە بنەڕەت دا پێکهاتەیەکی وەستایانەیە لە دوو شێوازی هێرشی دزینی IP و گوێ تەقێ. بەم جۆرە هێرشبەر خۆی لە جێگای ئێوە دادەنێ و هەڵدەستێ بە درێژە دانی کارەکانی ئێوە دە ناو ماڵپەڕدا بە پێی خواستی خۆی هەڵبەت هەر دە ڕادەی ڕادەستی خۆت دا ');
define($constpref.'_HIJACK_DENYGP','ئەم گرێیانەی کە IPئیزنی گۆڕانکاری دە دانیشتنی (نێوان کاربەر و ناوەرۆک) ی دا نییە');
define($constpref.'_HIJACK_DENYGPDSC','مقابله با دزدی جلسه (Anti Session Hi-Jacking):<br />گروه ‌های که IP شان در جلسه بین محتوا و کاربر نباید تغییر کند انتخاب کنید.<br />(پیشن‌هاد میشود فقط برای وب مستر ‌ها روشن باشد.)<br /><br />Session Hi-Jacking(دزدی جلسه): در اصل ترکیب ماهرانه ای است از دو نوع حمله ی دزدین IP و استراق سمع با این روش حمله یک م‌هاجم خودش را به جای شما جا زده و اقدام به ادامه دادن کار ‌ها و فعالیت ‌های شما در سایت مطابق خواسته ی خود میکند البته در حدی که شما دسترسی دارید');
define($constpref.'_HIJACK_DENYGPDSC','بە ر هەڵەست لەگەڵ دزی دانێشتن (Anti Session Hi-Jacking):<br />ئەم گرووپانەی کە IPییە کانییان لە دانیشتنی نێوان ناوەرۆک و کاربەر دا نابێ بگۆڕێت هەڵبژێرە.<br />(پێشنیار دەکرێت کە تەنیا بۆ وێب مەستێرەکان ڕۆشن بێت.)<br /><br />Session Hi-Jacking(دزی دانیشتن): دە بنەڕەت دا پێکهاتەیەکی وەستایانەیە لە دوو شێوازی هێرشی دزینی IP و گوێ تەقێ. بەم جۆرە هێرشبەر خۆی لە جێگای ئێوە دادەنێ و هەڵدەستێ بە درێژە دانی کارەکانی ئێوە دە ناو ماڵپەڕدا بە پێی خواستی خۆی هەڵبەت هەر دە ڕادەی ڕادەستی خۆت دا');
define($constpref.'_SAN_NULLBYTE','پاککردنەوەی بایتە خاڵییەکان');
define($constpref.'_SAN_NULLBYTEDSC','اگر در کارکتر ‌های پایان بخش به طور مکرر از "\\0" استفاده شده بود  این حرکت  یک حمله ثبت شود<br />بایت ‌های خالی با  فشار دادن کلید  space تغییر میکند<br />(به شدت توصیه میشود این گزینه روشن باشد)');
define($constpref.'_SAN_NULLBYTEDSC','ئەگەر دە کارێکتەرەکانی کۆتایی بەش بە جۆری  دووپاتە لە "\\0" کەڵک وەرگێرا بوو  ئەم کارە یەک هێرش دە ئەژمار دێت<br />بایتە خالییەکان بە داگرتنی کلیلی  space دەگۆڕدرێت<br />(بە تووندی پێشنیار دەکرێ کە ئەم تڵە ڕۆشن بێت)');
define($constpref.'_DIE_NULLBYTE','ئەگەر بایتی خاڵی دۆزرایەوە کاربەر لە ماڵپەڕ بکە دەرەوە.');
define($constpref.'_DIE_NULLBYTEDSC','The terminating character "\\0" is often used in malicious attacks.<br />(بە تووندی پێشنیار دەکریت کە ئەم تڵە ڕۆسن بیت)');
define($constpref.'_DIE_BADEXT','ئەگەر کاربەر فایلی خراپی دابەزاند لە سایتی بکە دەرەوە');
define($constpref.'_DIE_BADEXTDSC','اگر به فایل بارگذاری شده به وسیله ی کاربر لینک .php بدی الحاق شده بود  , این ماژول کاربر را از سایت محتوا شما بیرون می اندازد.<br />اگر شما بکرات فایل ‌های php  به ماژول ‌های PukiWiki و B-Wiki اضافه میکنید این گزینه را خاموش کنید');
define($constpref.'_CONTAMI_ACTION','نوع عملکرد اگر یک  آلودگی پیدا شد');
define($constpref.'_CONTAMI_ACTIONDS','رفتاری را که میخواید در برابر کاربری که قصد وارد کمردن داده ‌های نا مناسب به سیستم محتوا شما را دارد انجام شود مشخص کنید.<br />(پیشن‌هاد میشود بر روی صفحه ی سفید قرار دهید)');
define($constpref.'_DIE_BADEXTDSC','ئەگەر  بە فایلی دابەزێنراو بە دەستی کاربەری لینکەوە .php ییەکی خراپ لکێنرا بوو  , ئەم ماژۆلە کاربەر لە ماڵپەڕی ناوەرۆکی ئێوە دەکاتە دەرەوە.<br /> ئەگەر ئێوە بە شێوەی چەند پاتە php ی به ماژۆڵەکانی PukiWiki و B-Wiki زیاد دەکەن ئەم تڵە بکووژێنەوە ');
define($constpref.'_CONTAMI_ACTION','جۆری کار کردن ئەگەر هێرشێک  بەدیکرا');
define($constpref.'_CONTAMI_ACTIONDS','رفتاری را که میخواید در برابر کاربری که قصد وارد کمردن داده ‌های نا مناسب به سیستم محتوا شما را دارد انجام شود مشخص کنید.<br />(پیشن‌هاد میشود بر روی صفحه ی سفید قرار دهید)');
define($constpref.'_CONTAMI_ACTIONDS',' ئەم ڕەفتارەی کە کاتێک کاربەرێک دەیهەوێ دێیتای خراپ ڕەخنە بداتە ناو سیستەمی ناوەرۆکی ئێوە دابیین بکە.<br />(پێشنیار دەکرێ لە سەر لاپەڕەی سپی دابنرێت)');
define($constpref.'_CONTAMI_ACTIONDS','رفتاری را که میخواید در برابر کاربری که قصد وارد کمردن داده ‌های نا مناسب به سیستم محتوا شما را دارد انجام شود مشخص کنید.<br />(پیشن‌هاد میشود بر روی صفحه ی سفید قرار دهید)');
define($constpref.'_CONTAMI_ACTIONDS',' ئەم ڕەفتارەی کە کاتێک کاربەرێک دەیهەوێ دێیتای خراپ ڕەخنە بداتە ناو سیستەمی ناوەرۆکی ئێوە دابیین بکە.<br />(پێشنیار دەکرێ لە سەر لاپەڕەی سپی دابنرێت)');
define($constpref.'_ISOCOM_ACTION ','جۆری کارکرد کاتیک کە ڕای تاکە دێت بۆ ناو سیستەم');
define($constpref.'_ISOCOM_ACTIONDSC','جلوگیری ازوارد کردن داده ‌های خطر ناک به SQL:<br />این گزینه را فعال کنید  برای وقتی که  علامت ‌ها "/*" به صورت منفرد پیدا شد<br />معنی " پاک سازی داده ‌ها از کد ‌های خطرناک "در اینجا این است که علامت ‌های "*/" جداگانه در جدول ‌های پایگاه داده ‌ها اضافه شوند<br />(سفارش میشود تنظیم‌ها بر روی ((پاک سازی داده ‌ها از کد ‌های خطرناک)) باشد)');
define($constpref.'_ISOCOM_ACTIONDSC','پێشگری کردن لە هێنانی ژووری دێیتای مەترسیدار بە SQL:<br />ئەم تڵە بەکار بکە  بۆ کاتیک کە هێماکانی "/*" بە تەنیایی دۆزراوە<br />مانای " پاککردنەوەی دێیتا کان لە کۆدە مەترسیدارەکان"لێرە دا ئەوەیە کە هێماکانی "*/" بەشێوەی جیا زیاد بکرێنە ناو خشتەکانی بنکەی دییتا<br />(پێشنیار دەکریت کە ڕێکخستنەکان لە سەر ((پاک سازی داده ‌ها از کد ‌های پاککردنەوەی دێیتاکان لە کۆدەکانی مەترسیدار)) بێت)');
define($constpref.'_UNION_ACTION','کارکرد کاتیک کە یەک UNIONدۆزرایەوە');
define($constpref.'_UNION_ACTIONDSC','جلوگیری از وارد کردن داده ‌های خطر ناک به SQL:<br />نوع عملکرد را وقتی ترکیب هم جنسی از پیوند به SQL پیدا شد مشخص کنید<br />معنی "پاک سازی داده ‌ها از کد ‌های خطرناک" این است کهunion" " را به "uni-on" تغییر میدهد . یعنی اتحاد ترکیبات هم  جنس را  از بین میبرد و مانع ورود داده ‌های خطر ناک به پایگاه داده ‌ها گردد<br />(سفارش میشود تنظیم‌ها بر روی ((پاک سازی داده ‌ها از کد ‌های خطرناک)) باشد)');
define($constpref.'_UNION_ACTIONDSC','پێشگری کردن لە هێنانە ژووری دییتای مەترسیدار بۆSQL:<br />جۆری کارکرد کاتێک کە پێکهاتەیەکی هاو جنس لە پێوەندی SQL دۆزرایەوە دابیین بکە<br />مانای "پاککردنەوەی دێیتاکان لە کۆدە مەترسیدارەکان" ئەوەیە کە union" " به "uni-on" دەگۆڕێتەوە . یانی هاو دەنگی نێوان پێکهاتە هاو جنسەکان لە ناو دەبات و دەبیتە هەمبەر بۆ هاتنە ژووری دێیتا مەترسیدارەکان بۆ بنکەی دێتا <br />(پێشنیار دەکرێ کە ڕێکخستنەکان لە سەر ((پاککردنەوەی دێیتا لە کۆدە  مەترسیدارەکان)) بێت');
define($constpref.'_ID_INTVAL','ئەندازە ژمارەییەکان حەتمەن لێکدەوە بە بگۆڕە ژمارەییەکان');
define($constpref.'_ID_INTVALDSC','تمام در خواست ‌های که نام "*id" را دارند یک عدد صحیح در نظر گرفته شود.یعنی مانع قرار دادن هر چیز به جای عدد در جلوی  id  میشود<br />این گزینه از فرم شما در برابر   وارد کردن بعضی  از داده ‌های XSS و SQL محافظت میکند<br />این گزینه در حالت پیش فرض روشن میباشد اما ممکن است  باعث بروز مشکل در برخی از ماژول ‌ها شود.');
define($constpref.'_ID_INTVALDSC','تەواوی ئەو داخوازییانە کە ناوی"*id" ییان هەیە یک عدد ژمارەیەکی تەواو ڕەچاو بکرێت.یانی کردنە هەمبەری هەر شتێک لە پێش  id  دەبێت<br />ئەم تڵە لە فۆڕمی ئێوە لە بەرامبەر نووسیینی هەندێک لە دێیتاکان دا XSS و SQL دەپارێزێ<br />ئەم تڵە وەک پێشگر ڕۆشنە بەڵام شایەد ببێتە هۆی درووست بوونی هەندیک گرفت دە هەندێک لە ماژۆڵەکان دا .');
define($constpref.'_FILE_DOTDOT','پاراستن لە بەرامبەری پێوانی لقەکان دا');
define($constpref.'_FILE_DOTDOTDSC','تەواوی نیشانەکانی ".."لە هەموو داخوازییەکانی وەکوو یەک لە گەڵ پێوانی لقەکان ڕەشکەوە');
define($constpref.'_BF_COUNT','Anti Brute Force');
define($constpref.'_BF_COUNTDSC','تعداد دفعاتی را که کاربر مهمان میتواند نام کاربری و پسورد خود رادر مدت 10 دقیقه وارد کند  مشخص کنید اگر او بعد از گذشت این زمان موفق به ورود (login) نشد IP او توسط سیستم بسته شده است<br /><br />این روش هک روشی است که در آن هکر یک سری کلمات را به عنوان پسورددر نرم افزار هک وارد کرده و این کلمات به ترتیب به عنوان پسورد کاربر چک میشود');
define($constpref.'_BF_COUNT','Anti Brute Force');
define($constpref.'_BF_COUNTDSC','ژمارەی ئەم هەلانە کە کاربەری میوان دەتوانێ ناوی کاربەری و پاسۆردی خۆی لە 10 خولەک دا بنووسی  دابیین بکە. ئەگەر دوای گوزەرانی  ئەم کاتە نەیتوانی سەرکەوتوو بێت لە هاتنە ژووردا (login). IP ییەکەی بەدەستی سیستەم دەبەسرێت<br /><br />ئەم شێوازه لە هەککردن شێوازیکە کە هەکێر ژمارەیەک وشە وەک پاسۆرد دەخاتە ناو نەرم ئامێری هەک و ئەم وشانە وک پاسۆڕدی کاربەر چێک دەکرین');
define($constpref.'_BWLIMIT_COUNT','زێوارەی بەرینایی باند');
define($constpref.'_BWLIMIT_COUNTDSC','بیشترین دسترسی به mainfile.php را در زمان مشخص شده تعیین کنید. این مقدار در زمان ‌های که پهنای باند کافی CPU را در اختیار دارید بهتر است بر روی ۰ باشد. عدد کمتر از ۱۰ در نظر گرفته نمیشود.');
define($constpref.'_BWLIMIT_COUNTDSC','زیاترین ڕادەست بە mainfile.php را در زمان دە کاتی دیاریکراو دا دابین بکە. ئەم ئەندازەیە دەکاتێک دا کە بەرینایی باندی تەواوی CPU یتان لە بەر دەستە باشترە لە سەر ٠ بیت. ژمارەی کەمتر لە  ۱۰ ڕەجاو ناکریت.');
define($constpref.'_DOS_SKIPMODS','ئەم ماژۆڵانەی کە لە کاتی هێرشی DoS/Crawlerدا چێک ناکرین');
define($constpref.'_DOS_SKIPMODSDSC','نام ماژول ‌ها را با | از هم جدا کنید.همچنین این اجازه برای ماژول ‌ها ی چپ مفید خواهد بود.<br />منظور از Crawler روبات ‌های خزنده ی موتور ‌های جستجوگر میباشد');
define($constpref.'_DOS_SKIPMODSDSC','ناوی ماژۆڵەکان بە| لە یەکتر جیا کەوە.هەر وەها ئەم ئیزنە بۆ ماژۆڵەکانی چەپ بەکار دێت.<br />مەبەست لە Crawler رٶباتەکانی خشۆکی ماتۆڕەکانی گەڕانە');
define($constpref.'_DOS_EXPIRE','مکاتی پێویست بۆ دابەزاندنی زیاتر لە یەک چرکە');
define($constpref.'_DOS_EXPIREDSC','ئەم تڵە ڕوون دەکاتەوە.کاتی داخوازییەکانی لۆود(دابەزاندن)بوونی چەندپاتە(F5 attack)دابەزاندنی زیاد لە سنووری ڕۆباتەکانی خشۆکی ماتٶڕەکانی گەران چەندە بێت.');
define($constpref.'_DOS_F5COUNT','ژمارەی ریفرێشەکان بە F5 کە یەک هێرش حیساب دەکرێت');
define($constpref.'_DOS_F5COUNTDSC','از حملات DoS پیشگیری میکند.<br />تعداد مجاز ((دوباره بارگذاری کردن)) صفحات را مشخص کنید  بیش از این تعداد حمله  حساب میشود.');
define($constpref.'_DOS_F5COUNTDSC','لە هێرشەکانی DoS بەرگری دەکات.<br />ئەژماری  ئیزن پێدراو ((دووباره دابەزاندن)) لاپەڕەکان دابیین بکە ،زیاد لەم ئەندازە هێرش حیساب دەکرێت.');
define($constpref.'_DOS_F5ACTION','کاردانەوە لە بەرامبەر هێرش بە f5');
define($constpref.'_DOS_CRCOUNT','ئەژماری نادرووستی ڕۆباتە خشۆکەکان');
define($constpref.'_DOS_CRCOUNTDSC','جلو گیری کردن از لود بیش از حد  به وسیله ی روبات ‌های خزنده ی موتور ‌های جستجو.<br />عدد وارد شده تعداد  مناسب ورود ربات ‌های جستگور به سایت میباشد تعداد بیش از این یک حرکت غلط حساب میشود.');
define($constpref.'_DOS_CRCOUNTDSC','بەرگری کردن لە لٶودی زیادتر لە سنوور بە ڕۆباتە خشۆکەکانی ماتۆڕەکانی گەڕان.<br />ژمارەی نووسراو ئەژماری تەواوی هاتنە ژووری ڕۆباتە  گەڕۆکەکان بە ماڵپەرە ژمارەی زیاتر لەم سنوورە جووڵەیەکی هەڵەیە.');
define($constpref.'_DOS_CRACTION','بەرهەڵست بوون لە بەرامبەری لۆودی زیاد لە سنوور بە دەستی ڕۆباتە خشۆکەکان ماتۆرەکانی گەران');
define($constpref.'_DOS_CRSAFE','ڕۆباتە خشۆکەکانی ئیزن پێدراو بۆ هاتنە ژوور');
define($constpref.'_DOS_CRSAFEDSC','روش به کار رفته برای جدا سازی رباط ‌های خزنده متور ‌های جستجو (User-Agent) از هم.<br />اگر به خوبی تنظیم شود ( خزنده در لیست رو به رو باشد), رابط ‌های خزنده نمیتوانند لود بیش از حد ایجاد کنند.<br />نمونه :) /(msnbot|Googlebot|Yahoo! Slurp)/i');
define($constpref.'_DOS_CRSAFEDSC','ڕەوشی کەلک لێ وەرگیراو بۆ جیا کردنەوەی ڕۆباتە خشۆکەکانی ماتۆڕی گەڕان (User-Agent) لە یەکتر.<br />ئەگەر بەباشی ڕێکبخریت ( خشۆک لە سووڕەتی ڕووبەڕوو دا بێ), ڕۆباتە خشۆکەکان ناتوانن لۆەدی زیاد لە سنوور دروست بکەن.<br />نموونه :) /(msnbot|Googlebot|Yahoo! Slurp)/i');
define($constpref.'_OPT_NONE','ههیچکام (تەنیا گووزاریش)');
define($constpref.'_OPT_SAN','پاککردنەوەی دێیتاکان لە کۆدە مەترسیدارەکان');
define($constpref.'_OPT_EXIT','لاپەڕەی سپی');
define($constpref.'_OPT_BIP','داخستنیIP(بێ سنوور)');
define($constpref.'_OPT_BIPTIME0','داخستنی IP(سنووردار)');
define($constpref.'_DOSOPT_NONE','هیچکام (تەنیا گوزاریش)');
define($constpref.'_DOSOPT_SLEEP','خەوتن');
define($constpref.'_DOSOPT_EXIT','لاپەڕەی سپی');
define($constpref.'_DOSOPT_BIP','داخستنی IP(بێ سنوور)');
define($constpref.'_DOSOPT_BIPTIME0','داخستنی IP(سنووردار)');
define($constpref.'_DOSOPT_HTA','گەڕاندنەوەبە کەڵک وەرگرتن لە.htaccess(ئەزموونی)');
define($constpref.'_BIP_EXCEPT','ئەم گرووپانەی کە هیچکات لە IPییە خراپەکان دا دە ئەژمار نایەن');
define($constpref.'_BIP_EXCEPTDSC','کاربرانی که جز گروه انتخابی شما هستند هیچ وقت بن نمیشوند.<br />(پیشن‌هاد میشود فقط برای وب مستر ‌ها روشن باشد)');
define($constpref.'_BIP_EXCEPTDSC','ئەم کاربەرانەی کە لە گرووپە هەڵبژاردراوەکانی ئیوە دان هیچکات بن نابن.<br />(پێشنیار دەکری کە تەنیا بۆ وطب مەستێرەکان ڕۆشن بیت)');
define($constpref.'_DISABLES','تایبەتمەندییە مەترسیدارەکانی ناو ناورۆک لە کار بخە');
define($constpref.'_BIGUMBRELLA','بەکارکردنی anti-XSS(پارێزەری گەورە)');
define($constpref.'_BIGUMBRELLADSC','این گزینه از شما در برابر اکثر حمله ‌های که  بر اساس آسیب پذیری XSS برنامه ریزی شده اند محافظت میکند. اما 100% نیست<br /><br />حملات XSS شبیه به حملات تزیق اسکریپ میباشد و هدف اصلی از آن هک کردن سایت نیست بلکه حمله به کاربران است در این نوع حمله م‌هاجم کد ‌های خطر ناکی را در صفحات سایت وارد میکند که این کد ‌ها کامپیوتر کاربر را آلوده میکند');
define($constpref.'_BIGUMBRELLADSC','ئەم تڵە لە ئێوە دە بەرابەری زیاتری هێرشەکان دا  که  لە سەر بنەمای لاوازی XSS بەرنامه رێژی کراون پارێزگاری دەکات. بۆڵام 100% نییە<br /><br />هێرشەکانی XSS وەکوو هێرشەکانی تەزریقی(وەشاندنی) ئیسکریپتە و ئامانجی سەرەکی هەککردنی ماڵپەڕ نییە بەڵکوو هێرش بردنە سەر کاربەرانە دەم جۆرە هێرشانە دا هێرشبەر کۆدانێکی مەترسیدار دە لاپەڕەکانی ماڵپەڕدا دە نووسی  کە ئەم کۆدانە کامپیوتەری کاربەر ئالوودە دەکات');
define($constpref.'_SPAMURI4U','محافظ- هرزنامه (anti-SPAM): تعداد لینک ‌ها برای کابر معمولی');
define($constpref.'_SPAMURI4U','پارێزەر- هەرزنامه (anti-SPAM): ژمارەی لینکەکان بۆ کاربەرانی ئاسایی');
define($constpref.'_SPAMURI4UDSC','ئەگەر بە ئەندازەی ژمارەی دیاری کراو دە کادری ڕووبەڕوو دا لینک دەپۆستی کاربەردا دۆزراوە لەگەڵ پۆستەکەی ئەو وەک هەرز نامە بجوولێوە.بە هەڵبژارتنی سفر ئەم تڵە لەکار بخە');
define($constpref.'_SPAMURI4G','محافظ- هرزنامه (anti-SPAM): تعدا لینک ‌ها برای گروه ‌ها');
define($constpref.'_SPAMURI4G','پارێزەر- هەرزنامه (anti-SPAM): ئەژماری لینکەکان لەسەر گرووپەکان');
define($constpref.'_SPAMURI4GDSC','ئەگەر بە ئەندازەی ژمارەی دیاری کراو دە کادری ڕووبەڕوو دا لینک دەپۆستی گرووپەکان دا دۆزراوە لەگەڵ پۆستەکەی ئەوان وەک هەرز نامە بجوولێوە.بە هەڵبژارتنی سفر ئەم تڵە لەکار بخە');
define($constpref.'_STOPFORUMSPAM_ACTION','Stop Forum Spam');
define($constpref.'_STOPFORUMSPAM_ACTIONDSC','Checks POST data against spammers registered on www.stopforumspam.com database. Requires php CURL lib.');
}

?>