<?php
// $Id$
// _LANGCODE: ar
// _CHARSET : windows-1256
// Translator: Arab XOOPS Team

define( "_CONFIRM_UPGRADE_220", "
سيقوم معالج الترقية بنقل بيانات الاعضاء من برنامج (الملف الشخصي) المستخدم في موقعك.<br />
من فضلك لا تقوم بإزالة تركيب البرنامج يدويا , حتي لا تضيع بيانات الاعضاء.<br /><br />
بمجرد انتهاء عملية الترقية بالكامل <stong>اذهب الي لوحة التحكم في البرامج و ترقية برنامج الملف الشخصي</strong>, لضمان نقل بيانات الاعضاء بالكامل.<br /><br />
لإلغاء الترقية, <a href='index.php'>اضغط هنــا</a>.<br /><br />
او يمكنك  <a href='index.php?action=next&upd220=ok'>متابعة الترقية</a>.
");

?>
 
