<?php
// $Id$
// _LANGCODE: fa
// _CHARSET : UTF-8
// Translator: XOOPS Translation Team

$content .=
"<h3>سایت شما</h3>
سایتی ئێوه‌ 
<p>شما می‌توانید از این قسمت به <a href='../index.php'> صفحه اول سایت خود </a> بروید.</p>
<p> ئێوه‌ ده‌توانن له‌و به‌شه‌ ڕا بۆ<a href='../index.php'> لاپه‌ڕه‌ی یه‌که‌می سایت </a> بڕۆن </p>
<h3>پشتیوانی</h3>
";

$content .=
"<h3>تنظیمات امنیتی</h3>
رێکخستنی ئه‌منی
<p>سیستم نصب تلاش میکند سایت شما را برای ملاحظات امنیتی پیکربندی کند. لطفا با دقت برسی کنید تا اطمینان حاصل کنید:
<p> سیستمی دابه‌زاندن هه‌وڵ ده‌دا سایته‌که‌تان بۆ ره‌چاوکردنی باری ئه‌منی په‌یکه‌ربه‌ندی بکات. تکایه‌ به‌ وردی تاووتوێی بکه‌ن تا لێی دڵنیا بن:
<div class='confirmMsg'
فایل <em>mainfile.php</em> قابل نوشتن است.<br 
فایل <em>mainfile.php</em>شیاوی نووسینه‌.< br
لطفا شاخه <em>{$installer_modified}</em> (یا شاخه <em>install</em> را اگر به طور خودکار نام آن در سرور شما عوض نشده بود.)  از روی سرور خود حذف کنید.
تکایه‌ لکی  <em>{$installer_modified}</em (یان لکی <em>install</em> ئه‌گه‌ر به‌ شێوه‌ی خۆڕست نێوه‌که‌ له‌ سێروێری ئێوه‌ نه‌گۆڕدرابوو.) له‌ سه‌ر سێروێری خۆتان لایبه‌رن.
</div>
</p>

";

?>/