<?php
// _LANGCODE: fa
// _CHARSET : UTF-8
// Translator: XOOPS Translation Team

// License
define('LICENSE_NOT ', 'فایلی license شیاوی نووسین نییە .<br/> %s <br/><font style="colour:#ff0000">به فایلی ../include/license.php  ڕادەستی نووسین بدە</font>');
define('LICENSE_IS_WRITEABLE', 'فایلی licenseشیاوی نووسینە. %s');
define("_INSTALL_WEBMASTER","وێب مەستیرەکان");
define("_INSTALL_WEBMASTERD","وێب مەستێرەکانی ئەم ماڵپەڕە");
define("_INSTALL_REGUSERS","کاربەرانی ئەندام");
define("_INSTALL_REGUSERSD","گرووپی کاربەرانی ئەندام");
define("_INSTALL_ANONUSERS","کاربەری میوان");
define("_INSTALL_ANONUSERSD","گرووپی کاربەرانی میوان");

/**
* New Group types
*/
define('_INSTALL_BANNEDUSERS', 'ناسە داخراوەکان');
define('_INSTALL_BANNEDUSERSD', 'گرووپی ناسە داخراوەکان');
define('_INSTALL_MODERATORUSERS', 'بەڕێوبەران');
define('_INSTALL_MODERATORUSERSD', 'گرووپی بەڕێوبەرانی ماڵپەڕی ئێوە');
define('_INSTALL_SUBMITTERUSERS', 'بنێرەکان');
define('_INSTALL_SUBMITTERUSERSD', 'ئەندامانی ئەم گرووپە دەتوانن چەمکەکان بۆ ماڵپەڕی ئێوە بنیرن');
define('_INSTALL_DEVELOPEUSERS', 'بەڕبڵاو کەرەوەکان');
define('_INSTALL_DEVELOPEUSERSD', 'ئەم کاربەرە یەک بەربڵاوکەرەوەیەو دەتوانێ پەیامەکانی هەڵەی بەربڵاوکەرەوەکان ببینێت.');
define("_INSTALL_L165","ماڵپەڕ بۆ کەڵتە و ڕاگرتن و هێندێک لە بە ڕۆژ کردنەکان بەستراوە.تکایە دوایی وەرەوە.");
define("_INSTALL_ANON","میوان");

define("_INSTALL_DISCLMR", "
سرنج بدە:بە هۆی ئەوەی کە بەڕێوبەران و وێب مەستێرانی ئەم ماڵپەڕە توانایی چاوپێکەوتن و ئێدیتی خێرای پۆستەکانییان نییە. بەرپرسایەتی نووسراوەکان لە سەرشانی نووسەرانی پۆستەکانە ە لەم بابەتە دا بەڕیو بەران و وێب مەستێرانی ماڵپەڕ هیچ بەر پرسایەتییەک هەڵ ناگرن .
ئێوە بە ئەندام بوون دەم ماڵپەرە دا قەبووڵ دەکەن کە ئەم بابەتانەی کە سوکایەتی بەکەسانی تربکات.بابەتی پڕوپوچ،بێ بایەخ، ناحەز،بوختاناوی،بەدیهێنەری دوشمنی و تۆقاندن،بەر هەڵستی ئەخلاق و عورفی گشتی،نەنووسن
بە نووسینی هەر یەک لەم بابەتانە ئێوە خێرا لە ماڵپەڕ دەردەکرێن.
IPتەواوی پۆستەکان پاشکەوت دەکرێ تا ئەم جۆرە ڕووداوانە بە وردبینییەوە شوێنگیری بکرێت.سرنج بدە کە بوونی دووناسە بۆ کەسێک قەدەغەیە.
ئێوە بە ئەندامەتی دەم ماڵپەرە دا قەبووڵ دەکەن کە:وێب مەستێران و بەڕێوبەرانی ماڵپەر بەهەر بەڵگەیەگ یا هەرهۆیەک پۆستەکانی ئێوە ئێدیت یا ڕەشکەنەوە و یا سەردێڕەکان ببیینن.وەکو کاربەرێک ئێوە قەبووڵ دەکەن کە تەواووی نووسراوەکانت دە دێیتا بێس دا پاشکەوت بکرێت،
ئەگەر دە هەر کاتێک دا زانیارییەکانی ئیوە بە دەستی کەسانی ترەوە  بێ ئیزنی ئیوە کەڵکی نارەوای لێ وەرگیرا وێب مەستێرەکان و بەڕێوبەرانی ماڵپەڕ هیچ بەرپرسیارییەک قەبووڵ ناکەن حەتا ئەگەر ئەم زانیارییانە ببێتە هوی هەک کردن،یا زیانی ڕۆحی و حەتا زیانی گیانی و ماڵی،
سیستەمی ئەم ماڵپەڕە لە کووکی بۆ پاشکەوت کردنی زانیارییە کەسییەکانی ئێوە دە کۆمپیتەری خۆتاندا کەڵک وەر دەگرێ ئەم کووکییانە لە خۆگری ئەم زانیارییانە نییە کە ئێوە دە ماڵپەڕ دا دەینووسی و تەنیا بۆ ئاسانتر بوونی چاوپێکەوتنی ئێوە لە ماڵپەڕە.
ئیمێڵێک کە ئێوە لەکاتی ناونووسین دا بە ئێمەوداوە تەنیا بۆ زانیاری دان بە ئێوە و ناردنی پاسۆڕدی تازە و زانیینی بەڕۆژ بوونی بەشەکانی ماڵپەڕو لەم چۆرە بابەتانانە دا بەکار دەگیرێ.
");

?>