<?php
// _LANGCODE: fa
// _CHARSET : UTF-8
// Translator: XOOPS Translation Team

$content .= '
	<acronym title="eXtensible Object-Oriented Portal System">ناوەرۆک</acronym>
	سیستەمێکی زییندوو  OO (شت گەرا) و ئەم ‌سۆرسەیە که بە زمانی php نووسراوە.
	بەکار بردنی ناوەرۆک تڵێکی زۆر باشە بۆ درووست کردنی ماڵپەڕانێکی زیندووی گەورە تا بچووک لە سەر بنەمای چەمکی کامیوونێتی پۆڕتاڵەکانی ناو کۆمپانیاکان، پۆڕتالی کەسی یاسایی، وێبلاگەکان و زۆرێک لە بابەتە کانی تر	
</p>
<p>
ناوەرۆک لە ژێر ئیزنی بلاو کردنەوەدا
	<a href="http://www.gnu.org/copyleft/gpl.html" >
ئیزنی گشتی گنو (GPL)
</a>
بڵاو کراوەتەوە و کەڵک لێ وەرگرتنی گۆڕینی کۆدەکانی بە مفتەیە و بی لەمپەرە
بە مەرجی نەگۆڕینی ئیزنی بڵاو کردنەوە.دەتوانی دووبارە بڵاوی کەیەوە
</p>
<h3>پێویستییەکان</h3>
<ul>
	<li>کارگزار وب (<a href="http://www.apache.org/" target="_blank">آپاچی</a>، IIS, Roxen، و غیره...)</li>
	<li><a href="http://www.php.net/" target="_blank">PHP</a> نسخه ۵.۲.۰ یا بالاتر</li>
	<li><a href="http://www.mysql.com/" target="_blank">MySQL</a> نسخه ۵.۱ یابالاتر</li>
</ul>
<h3>قبل از نصب</h3>
<ol>
	<li>کارگێری وێب (<a href="http://www.apache.org/" target="_blank">ئاپاچی</a>، IIS, Roxen، و غیره...)</li>
	<li><a href="http://www.php.net/" target="_blank">PHP</a> ڕوونووسی ۵.۲.۰ یا نوێ تر</li>
	<li><a href="http://www.mysql.com/" target="_blank">MySQL</a> ڕوونووسی ۵.۱ یا نوێ تر</li>
</ul>
<h3>پێش دابەزاندن</h3>
<ol>
   <li>کارگزار WWW، بنکەی دێیتا و PHP ئەشێ لە سەر ‌هاستی ئێوە دابەزێنرا بێ.</li>
	<li>یک پایگاه‌داده باید ساخته باشید.</li>
<li>ئەبێ بنکەیەکی دێیتاو درووست کردبێت.</li>
    <li>یەک ناسەی کاربەری بۆ بنکەگەلی دێیتا کە درووستت کردوە نووسیبت و ئەم ناسەیە تایبەت کەی بەبنکەی دێیتا.</li>
	<li>بە لقەکان و فایلەکانی ژێرەوە ڕادەستی نووسین بدە : %s</li>
	<li>بە هۆی ڕەوشی ئەمنی ئێوە ئەبێ لقەکانی بنەوە بۆ دەرەوی مالپەڕ ڕاگوازی <a href="http://phpsec.org/projects/guide/3.html" rel="external">لقی ڕیشەیی ماڵپەڕ</a>ڕاگوازی یاناوی ئەم لقەت گۆڕیبێت. : %s</li>
<li>لقەکانی ژێر درووست بکەو ڕادەستی نووسینییان بدەیە : %s</li>
<li>کووکی و جاوائیسکریپت لە سەر ئیکسپلۆری خۆت بەکار بکە.</li>
</ol>
';
?>