مرحبا {X_UNAME},

{X_ITEM_NBPHOTO} صورة جديدة اضيفت في "{X_ITEM_CAT}" في {X_SITENAME} وتنتظر موافقتك.

يمكنك مشاهدتها بالضغط هنا : {X_ITEM_URL}

-----------

وصلتك هذه الرسالة لانك اخترت ان يتم تنبيهك في حال اضافة صور جديدة في موقعنا.

ان كنت تلقيت هذه الرسالة عن طريق الخطأ او لا تريد ان تتلقى المزيد من التنبيهات من موقعنا, من فضلك قم بتحديث تسجيلك على هذا الرابط:
{X_UNSUBSCRIBE_URL}

من فضلك لا تجاوب على هذه الرسالة.

-----------

{X_SITENAME} ({X_SITEURL}) 
مدير الموقع
{X_ADMINMAIL} 
