مرحبا {X_UNAME}

تمت اضافة تعليق على  {X_ITEM_TYPE} "{X_ITEM_NAME}" حسب طلبك التبليغ على برنامج {X_MODULE} في موقعنا.

يمكنك مشاهدة التعليق عن طريق الضغط على الرابط أدناه 
{X_COMMENT_URL}

-----------

لقد تم تبليغك عن هذا التعليق لأنك قمت بطلب تبليغ بريدي في حالة إضافة تعليق على  {X_ITEM_TYPE}

اذا كان هذا البريد عن طريق الخطأ ولا تود استقبال المزيد من التبليغات يمكنك الضغط على الرابط التالي 
{X_UNSUBSCRIBE_URL}

أرجو عدم الرد على هذا البريد

-----------
{X_SITENAME} ({X_SITEURL}) 
مدير الموقع
{X_ADMINMAIL}
 
